## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # zentral_santa_rule.teamid-macpaw will be created
  + resource "zentral_santa_rule" "teamid-macpaw" {
      + configuration_id        = 1
      + custom_message          = "No MacPaw apps are allowed!!!"
      + description             = "Block MacPaw apps, mostly for demo purposes"
      + excluded_primary_users  = []
      + excluded_serial_numbers = []
      + excluded_tag_ids        = []
      + id                      = (known after apply)
      + policy                  = "BLOCKLIST"
      + primary_users           = []
      + ruleset_id              = (known after apply)
      + serial_numbers          = []
      + tag_ids                 = []
      + target_identifier       = "S8EX82NJP6"
      + target_type             = "TEAMID"
      + version                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>